# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'heroku/brew'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'sqlite'
brew 'heroku'
brew 'postgresql'
brew 'gh'
brew 'svn'

# Apps
cask '1password'
cask 'discord'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'there'
cask 'visual-studio-code'
cask 'iterm2'

# Fonts
cask 'font-cascadia-mono-pl'
cask 'font-ibm-plex-mono'
cask 'font-monaspace'
